<a href="https://colab.research.google.com/github/Mahii9607/DSBDA-practical-/blob/main/DSBDA_A%3D3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
df=pd.read_csv('C:/Users/dell/Downloads/Assign_3_Mall_Customers.csv')

In [ ]:
df1=df
df2=df1
df3=df
df4=df

In [ ]:
df

     CustomerID  Gender   Age Group  Age  Salary  Spending Score (1-100)
0             1    Male        Teen   19      15                      39
1             2    Male  Middle Age   21      15                      81
2             3  Female  Middle Age   20      16                       6
3             4  Female  Middle Age   23      16                      77
4             5  Female  Middle Age   31      17                      40
..          ...     ...         ...  ...     ...                     ...
195         196  Female  Middle Age   35     120                      79
196         197  Female       Elder   45     126                      28
197         198    Male  Middle Age   32     126                      74
198         199    Male  Middle Age   32     137                      18
199         200    Male  Middle Age   30     137                      83

[200 rows x 6 columns]

In [ ]:
df.columns

Index(['CustomerID', 'Gender', 'Age Group', 'Age', 'Salary',
       'Spending Score (1-100)'],
      dtype='object')

In [ ]:
print(df['Salary'].mean())

60.56

In [ ]:
print(df['Salary'].mode())

0    54
1    78
Name: Salary, dtype: int64

In [ ]:
print(df['Salary'].median())

61.5

In [ ]:
print(df['CustomerID'].mean())

100.5

In [ ]:
print(df['CustomerID'].mode())

0        1
1        2
2        3
3        4
4        5
      ...
195    196
196    197
197    198
198    199
199    200
Name: CustomerID, Length: 200, dtype: int64

In [ ]:
print(df['CustomerID'].median())

100.5

In [ ]:
print(df['Gender'].mode())

0    Female
Name: Gender, dtype: object

In [ ]:
print(df['Age Group'].mode())

0    Middle Age
Name: Age Group, dtype: object

In [ ]:
print(df['Age'].mean())

38.85

In [ ]:
print(df['Age'].mode())

0    32
Name: Age, dtype: int64

In [ ]:
print(df['Age'].median())

36.0

In [ ]:
print(df['Spending Score (1-100)'].mean())

50.2

In [ ]:
print(df['Spending Score (1-100)'].mode())

0    42
Name: Spending Score (1-100), dtype: int64

In [ ]:
print(df['Spending Score (1-100)'].median())

50.0

In [ ]:
df['CustomerID']

0        1
1        2
2        3
3        4
4        5
      ...
195    196
196    197
197    198
198    199
199    200
Name: CustomerID, Length: 200, dtype: int64

In [ ]:
df['Gender']

0        Male
1        Male
2      Female
3      Female
4      Female
        ...
195    Female
196    Female
197      Male
198      Male
199      Male
Name: Gender, Length: 200, dtype: object

In [ ]:
df['Age Group']

0            Teen
1      Middle Age
2      Middle Age
3      Middle Age
4      Middle Age
          ...
195    Middle Age
196         Elder
197    Middle Age
198    Middle Age
199    Middle Age
Name: Age Group, Length: 200, dtype: object

In [ ]:
df['Age']

0      19
1      21
2      20
3      23
4      31
       ..
195    35
196    45
197    32
198    32
199    30
Name: Age, Length: 200, dtype: int64

In [ ]:
df['Salary']

0       15
1       15
2       16
3       16
4       17
      ...
195    120
196    126
197    126
198    137
199    137
Name: Salary, Length: 200, dtype: int64

In [ ]:
df['Spending Score (1-100)']

0      39
1      81
2       6
3      77
4      40
       ..
195    79
196    28
197    74
198    18
199    83
Name: Spending Score (1-100), Length: 200, dtype: int64

In [ ]:
df.isnull()

     CustomerID  Gender  Age Group    Age  Salary  Spending Score (1-100)
0         False   False      False  False   False                   False
1         False   False      False  False   False                   False
2         False   False      False  False   False                   False
3         False   False      False  False   False                   False
4         False   False      False  False   False                   False
..          ...     ...        ...    ...     ...                     ...
195       False   False      False  False   False                   False
196       False   False      False  False   False                   False
197       False   False      False  False   False                   False
198       False   False      False  False   False                   False
199       False   False      False  False   False                   False

[200 rows x 6 columns]

In [ ]:
df.isnull().sum()

CustomerID                0
Gender                    0
Age Group                 0
Age                       0
Salary                    0
Spending Score (1-100)    0
dtype: int64

In [ ]:
df.describe()

       CustomerID         Age      Salary  Spending Score (1-100)
count  200.000000  200.000000  200.000000              200.000000
mean   100.500000   38.850000   60.560000               50.200000
std     57.879185   13.969007   26.264721               25.823522
min      1.000000   18.000000   15.000000                1.000000
25%     50.750000   28.750000   41.500000               34.750000
50%    100.500000   36.000000   61.500000               50.000000
75%    150.250000   49.000000   78.000000               73.000000
max    200.000000   70.000000  137.000000               99.000000

In [ ]:
df2.head()

   CustomerID  Gender   Age Group  Age  Salary  Spending Score (1-100)
0           1    Male        Teen   19      15                      39
1           2    Male  Middle Age   21      15                      81
2           3  Female  Middle Age   20      16                       6
3           4  Female  Middle Age   23      16                      77
4           5  Female  Middle Age   31      17                      40

In [ ]:
df1.head()

   CustomerID  Gender   Age Group  Age  Salary  Spending Score (1-100)
0           1    Male        Teen   19      15                      39
1           2    Male  Middle Age   21      15                      81
2           3  Female  Middle Age   20      16                       6
3           4  Female  Middle Age   23      16                      77
4           5  Female  Middle Age   31      17                      40

In [ ]:
df3.head()

   CustomerID  Gender   Age Group  Age  Salary  Spending Score (1-100)
0           1    Male        Teen   19      15                      39
1           2    Male  Middle Age   21      15                      81
2           3  Female  Middle Age   20      16                       6
3           4  Female  Middle Age   23      16                      77
4           5  Female  Middle Age   31      17                      40

In [ ]:
df4.head()

   CustomerID  Gender   Age Group  Age  Salary  Spending Score (1-100)
0           1    Male        Teen   19      15                      39
1           2    Male  Middle Age   21      15                      81
2           3  Female  Middle Age   20      16                       6
3           4  Female  Middle Age   23      16                      77
4           5  Female  Middle Age   31      17                      40

In [ ]:
df.replace(to_replace=np.nan,value=80)

     CustomerID  Gender   Age Group  Age  Salary  Spending Score (1-100)
0             1    Male        Teen   19      15                      39
1             2    Male  Middle Age   21      15                      81
2             3  Female  Middle Age   20      16                       6
3             4  Female  Middle Age   23      16                      77
4             5  Female  Middle Age   31      17                      40
..          ...     ...         ...  ...     ...                     ...
195         196  Female  Middle Age   35     120                      79
196         197  Female       Elder   45     126                      28
197         198    Male  Middle Age   32     126                      74
198         199    Male  Middle Age   32     137                      18
199         200    Male  Middle Age   30     137                      83

[200 rows x 6 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age Group               200 non-null    object
 3   Age                     200 non-null    int64
 4   Salary                  200 non-null    int64
 5   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(2)
memory usage: 9.5+ KB

In [ ]:
print(df.shape)

(200, 6)

In [ ]:
print(df.head(20))

    CustomerID  Gender   Age Group  Age  Salary  Spending Score (1-100)
0            1    Male        Teen   19      15                      39
1            2    Male  Middle Age   21      15                      81
2            3  Female  Middle Age   20      16                       6
3            4  Female  Middle Age   23      16                      77
4            5  Female  Middle Age   31      17                      40
5            6  Female  Middle Age   22      17                      76
6            7  Female  Middle Age   35      18                       6
7            8  Female  Middle Age   23      18                      94
8            9    Male       Elder   64      19                       3
9           10  Female  Middle Age   30      19                      72
10          11    Male       Elder   67      19                      14
11          12  Female  Middle Age   35      19                      99
12          13  Female       Elder   58      20                      15
13          14  Female  Middle Age   24      20                      77
14          15    Male  Middle Age   37      20                      13
15          16    Male  Middle Age   22      20                      79
16          17  Female  Middle Age   35      21                      35
17          18    Male  Middle Age   20      21                      66
18          19    Male       Elder   52      23                      29
19          20  Female  Middle Age   35      23                      98

In [ ]:
df['Age Group'].value_counts(normalize=True)

Middle Age    0.52
Elder         0.42
Teen          0.06
Name: Age Group, dtype: float64

In [ ]:
df['CustomerID'].value_counts(normalize=True)

1      0.005
138    0.005
128    0.005
129    0.005
130    0.005
       ...
70     0.005
71     0.005
72     0.005
73     0.005
200    0.005
Name: CustomerID, Length: 200, dtype: float64

In [ ]:
df['Gender'].value_counts(normalize=True)

Female    0.56
Male      0.44
Name: Gender, dtype: float64

In [ ]:
df['Age'].value_counts(normalize=True)

32    0.055
35    0.045
19    0.040
31    0.040
30    0.035
49    0.035
40    0.030
38    0.030
47    0.030
27    0.030
36    0.030
23    0.030
34    0.025
20    0.025
29    0.025
50    0.025
48    0.025
21    0.025
24    0.020
18    0.020
28    0.020
67    0.020
59    0.020
54    0.020
43    0.015
60    0.015
45    0.015
39    0.015
33    0.015
37    0.015
22    0.015
25    0.015
46    0.015
68    0.015
52    0.010
44    0.010
66    0.010
57    0.010
26    0.010
53    0.010
42    0.010
63    0.010
70    0.010
51    0.010
58    0.010
65    0.010
41    0.010
55    0.005
69    0.005
64    0.005
56    0.005
Name: Age, dtype: float64

In [ ]:
df['Salary'].value_counts(normalize=True)

54     0.06
78     0.06
48     0.03
71     0.03
63     0.03
       ...
58     0.01
59     0.01
16     0.01
64     0.01
137    0.01
Name: Salary, Length: 64, dtype: float64

In [ ]:
df['Spending Score (1-100)'].value_counts(normalize=True)

42    0.040
55    0.035
46    0.030
73    0.030
35    0.025
      ...
31    0.005
44    0.005
53    0.005
65    0.005
18    0.005
Name: Spending Score (1-100), Length: 84, dtype: float64

In [ ]:
df = pd.DataFrame([['Male', 19, 15],
                  ['Female', 22, 17],
                  ['Female', 35, 21]])
df.columns = ['Gender','Age','Salary']
df.head()

   Gender  Age  Salary
0    Male   19      15
1  Female   22      17
2  Female   35      21